# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов
# исходной последовательности.

numbers = [3, 7, 0, -2, 12, 3, 7, -14, 12.8, 12.0, 4, 44, 44, 7, 0, 6, 25, 1, 11]

new_set = set(numbers)
print(new_set)

